src/istio/concept.org
#+TITLE: 概念
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+HTML_LINK_UP: istio.html   
#+HTML_LINK_HOME: istio.html
#+OPTIONS: num:nil timestamp:nil ^:nil
* Istio 是什么？
  #+begin_example
    云平台令使用它们的公司受益匪浅，但不可否认的是，上云会给 DevOps 团队带来压力

    为了可移植性，开发人员必须使用微服务来构建应用，同时运维人员也正在管理着极端庞大的混合云和多云的部署环境
  #+end_example
  Istio 允许您 _连接_ 、 _保护_ 、 _控制_ 和 _观察_ 服务。从较高的层面来说，Istio 有助于降低这些部署的复杂性，并减轻开发团队的压力：
  + 它是一个完全开源的 _服务网格_ ，作为 _透明的一层_ 接入到现有的分布式应用程序里
  + 它也是一个 _平台_ ，拥有可以集成任何 _日志_ 、_ 遥测_ 和 _策略_ 系统的 _API 接口_ 

  Istio 多样化的特性使您能够成功且高效地运行分布式微服务架构，并提供保护、连接和监控微服务的统一方法
** 服务网格 
   _服务网格_ 用来描述组成这些应用程序的微服务网络以及它们之间的交互。随着服务网格的规模和复杂性不断的增长，它将会变得越来越难以理解和管理。它的需求包括 _服务发现_ 、 _负载均衡_ 、 _故障恢复_ 、 _度量_ 和 _监控_ 等。服务网格通常还有更复杂的运维需求，比如 _A/B 测试_ 、 _金丝雀发布_ 、 _速率限制_ 、 _访问控制_ 和 _端到端认证_ 

   #+begin_example
     Istio 提供了对整个服务网格的行为洞察和操作控制的能力，以及一个完整的满足微服务应用各种需求的解决方案
   #+end_example
** 为什么使用 Istio？
   通过负载均衡、服务间的身份验证、监控等方法，Istio 可以轻松地创建一个已经部署了服务的网络，而服务的代码只需很少更改甚至无需更改。通过在整个环境中部署一个特殊的 _sidecar 代理_ 为服务添加 Istio 的支持，而代理会 *拦截* _微服务之间_ 的所有 _网络通信_ ，然后使用其 _控制平面_ 的功能来 *配置* 和 *管理* Istio，这包括：
   + 为 HTTP、gRPC、WebSocket 和 TCP 流量自动 _负载均衡_ 
   + 通过丰富的 _路由规则_ 、 _重试_ 、 _故障转移_ 和 _故障注入_ 对 *流量行为* 进行 _细粒度控制_
   + 可插拔的策略层和配置 API，支持 _访问控制_ 、 _速率限制_ 和 _配额_
   + 集群内（包括集群的入口和出口）所有流量的 _自动化度量_ 、 _日志记录_ 和 _追踪_
   + 在具有强大的基于 _身份验证_ 和 _授权_ 的集群中实现 *安全的* 服务间通信 

   #+begin_example
   Istio 为可扩展性而设计，可以满足不同的部署需求
   #+end_example
** 核心特性
   Istio 以统一的方式提供了许多跨服务网络的关键功能
*** 流量管理
    Istio 简单的 _规则配置_ 和 _流量路由_ 允许您控制服务之间的流量和 API 调用过程。Istio 简化了 *服务级属性* （如 _熔断器_ 、 _超时_ 和 _重试_ ）的配置，并且让它轻而易举的执行重要的任务（如 _A/B 测试_ 、 _金丝雀发布_ 和 _按流量百分比_ 划分的分阶段发布） 

    #+begin_example
      有了更好的对流量的可视性和开箱即用的故障恢复特性，您就可以在问题产生之前捕获它们，无论面对什么情况都可以使调用更可靠，网络更健壮
    #+end_example
*** 安全
    Istio 的安全特性解放了开发人员，使其只需要专注于应用程序级别的安全。Istio 提供了 *底层的安全通信通道* ，并为大规模的服务通信管理 _认证_ 、 _授权_ 和 _加密_ 
    #+begin_example
      有了 Istio，服务通信在默认情况下就是受保护的，可以让您在跨不同协议和运行时的情况下实施一致的策略――而所有这些都只需要很少甚至不需要修改应用程序

      Istio 是独立于平台的，可以与 Kubernetes（或基础设施）的网络策略一起使用。但它更强大，能够在网络和应用层面保护pod到 pod 或者服务到服务之间的通信
    #+end_example
*** 可观察性
    Istio 健壮的 _追踪_ 、 _监控_ 和 _日志_ 特性让您能够深入的了解服务网格部署
    #+begin_example
      通过 Istio 的监控能力，可以真正的了解到服务的性能是如何影响上游和下游的

      而它的定制 Dashboard 提供了对所有服务性能的可视化能力，并让您看到它如何影响其他进程
    #+end_example
    Istio 的 _Mixer 组件_ 负责 *策略控制* 和 *遥测数据收集* 。它提供了后端抽象和中介，将一部分 Istio 与后端的基础设施实现细节隔离开来，并为运维人员提供了对网格与后端基础实施之间交互的细粒度控制

    #+begin_example
    所有这些特性都使您能够更有效地设置、监控和加强服务的 SLO。当然，底线是您可以快速有效地检测到并修复出现的问题
    #+end_example
*** 平台支持
    Istio 独立于平台，被设计为可以在各种环境中运行，包括跨云、内部环境、Kubernetes、Mesos 等等。可以在 Kubernetes 或是装有 Consul 的 Nomad 环境上部署 Istio。Istio 目前支持：
    + Kubernetes 上的服务部署
    + 基于 Consul 的服务注册
    + 服务运行在独立的虚拟机上
* 流量管理
  #+begin_example
    Istio 的 流量路由规则可以让您很容易的控制服务之间的流量和 API 调用

    Istio 简化了服务级别属性的配置，比如熔断器、超时和重试，并且能轻松的设置重要的任务，如 A/B 测试、金丝雀发布、基于流量百分比切分的概率发布等

    它还提供了开箱即用的故障恢复特性，有助于增强应用的健壮性，从而更好地应对被依赖的服务或网络发生故障的情况
  #+end_example
  Istio 的流量管理模型源于和 _服务一起部署_ 的 _Envoy 代理_ 。 _网格内服务_ *发送* 和 *接收* 的  _所有流量_ （data plane流量）都经由 _Envoy_ *代理* 

  #+begin_example
    这让控制网格内的流量变得异常简单，而且不需要对服务做任何的更改
  #+end_example
** 介绍
   为了在网格中导流，Istio 需要知道所有的 endpoint 在哪和属于哪个服务。为了定位到 _service registry_ (服务注册中心)，Istio 会连接到一个服务发现系统
   #+begin_example
     例如，如果您在 Kubernetes 集群上安装了 Istio，那么它将自动检测该集群中的服务和 endpoint
   #+end_example

   使用此服务注册中心，Envoy 代理可以将流量定向到相关服务。大多数基于微服务的应用程序，每个服务的工作负载都有多个实例来处理流量，称为 _负载均衡池_ 。默认情况下，Envoy 代理基于 _轮询调度_ 模型在服务的负载均衡池内分发流量，按顺序将请求发送给池中每个成员，一旦所有服务实例均接收过一次请求后，重新回到第一个池成员 

   #+begin_example
     Istio 基本的服务发现和负载均衡能力为您提供了一个可用的服务网格，但它能做到的远比这多的多

     在许多情况下，您可能希望对网格的流量情况进行更细粒度的控制

     作为 A/B 测试的一部分，您可能想将特定百分比的流量定向到新版本的服务，或者为特定的服务实例子集应用不同的负载均衡策略

     您可能还想对进出网格的流量应用特殊的规则，或者将网格的外部依赖项添加到服务注册中心
   #+end_example

   通过使用 Istio 的 _流量管理 API_ 将流量配置添加到 Istio，就可以完成所有这些甚至更多的工作 

   #+begin_example
     和其他 Istio 配置一样，这些 API 也使用 Kubernetes 的自定义资源定义（CRDs）来声明，可以像示例中看到的那样使用 YAML 进行配置
   #+end_example
** 虚拟服务
   _虚拟服务_ （Virtual Service） 和 _目标规则_ （Destination Rule） 是 Istio 流量路由功能的关键拼图。虚拟服务让您配置如何在服务网格内将请求路由到服务，这基于 Istio 和平台提供的基本的连通性和服务发现能力。每个虚拟服务包含一组 _路由规则_ ，Istio 按顺序评估它们，Istio 将每个给定的请求匹配到虚拟服务指定的实际目标地址

   #+begin_example
     您的网格可以有多个虚拟服务，也可以没有，取决于您的使用场景
   #+end_example

