html/istio/concept.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>概念</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="istio.html"> UP </a>
 |
 <a accesskey="H" href="istio.html"> HOME </a>
</div><div id="content">
<h1 class="title">概念</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaf72cef">Istio 是什么？</a>
<ul>
<li><a href="#orgb1c4845">服务网格</a></li>
<li><a href="#org9f7399d">为什么使用 Istio？</a></li>
<li><a href="#orgc510aea">核心特性</a>
<ul>
<li><a href="#org868f397">流量管理</a></li>
<li><a href="#orgc87e647">安全</a></li>
<li><a href="#org404ad8e">可观察性</a></li>
<li><a href="#org3125273">平台支持</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org29427c8">流量管理</a>
<ul>
<li><a href="#org6ccb038">介绍</a></li>
<li><a href="#org201b2c4">虚拟服务</a>
<ul>
<li><a href="#org667d199">为什么使用虚拟服务？</a></li>
<li><a href="#org2526fb6">虚拟服务示例</a>
<ul>
<li><a href="#orga07f878">hosts 字段</a></li>
<li><a href="#org4ff0408">路由规则</a></li>
<li><a href="#org894d9da">路由规则优先级</a></li>
</ul>
</li>
<li><a href="#orgbb61912">路由规则的更多内容</a></li>
</ul>
</li>
<li><a href="#org76a120b">目标规则</a>
<ul>
<li><a href="#org8c288cc">负载均衡选项</a></li>
<li><a href="#org9c7bcb3">目标规则示例</a></li>
</ul>
</li>
<li><a href="#org1794566">网关</a>
<ul>
<li><a href="#org87f7bf8">Gateway 示例</a></li>
</ul>
</li>
<li><a href="#orgcc9c1f8">服务入口</a>
<ul>
<li><a href="#org1359c0f">服务入口实例</a></li>
</ul>
</li>
<li><a href="#orge5bfea4">Sidecar</a></li>
<li><a href="#org4dabbd0">网络弹性和测试</a>
<ul>
<li><a href="#org9c0df61">超时</a></li>
<li><a href="#orgdaa2239">重试</a></li>
<li><a href="#org5474a4b">熔断器</a></li>
<li><a href="#orgf5cfbbf">故障注入</a></li>
<li><a href="#org83c88d5">和您的应用程序一起运行</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf72cef" class="outline-2">
<h2 id="orgaf72cef">Istio 是什么？</h2>
<div class="outline-text-2" id="text-orgaf72cef">
<pre class="example">
    云平台令使用它们的公司受益匪浅，但不可否认的是，上云会给 DevOps 团队带来压力

    为了可移植性，开发人员必须使用微服务来构建应用，同时运维人员也正在管理着极端庞大的混合云和多云的部署环境
</pre>
<p>
Istio 允许您 <span class="underline">连接</span> 、 <span class="underline">保护</span> 、 <span class="underline">控制</span> 和 <span class="underline">观察</span> 服务。从较高的层面来说，Istio 有助于降低这些部署的复杂性，并减轻开发团队的压力：
</p>
<ul class="org-ul">
<li>它是一个完全开源的 <span class="underline">服务网格</span> ，作为 <span class="underline">透明的一层</span> 接入到现有的分布式应用程序里</li>
<li>它也是一个 <span class="underline">平台</span> ，拥有可以集成任何 <span class="underline">日志</span> 、_ 遥测_ 和 <span class="underline">策略</span> 系统的 <span class="underline">API 接口</span></li>
</ul>

<p>
Istio 多样化的特性使您能够成功且高效地运行分布式微服务架构，并提供保护、连接和监控微服务的统一方法
</p>
</div>
<div id="outline-container-orgb1c4845" class="outline-3">
<h3 id="orgb1c4845">服务网格</h3>
<div class="outline-text-3" id="text-orgb1c4845">
<p>
<span class="underline">服务网格</span> 用来描述组成这些应用程序的微服务网络以及它们之间的交互。随着服务网格的规模和复杂性不断的增长，它将会变得越来越难以理解和管理。它的需求包括 <span class="underline">服务发现</span> 、 <span class="underline">负载均衡</span> 、 <span class="underline">故障恢复</span> 、 <span class="underline">度量</span> 和 <span class="underline">监控</span> 等。服务网格通常还有更复杂的运维需求，比如 <span class="underline">A/B 测试</span> 、 <span class="underline">金丝雀发布</span> 、 <span class="underline">速率限制</span> 、 <span class="underline">访问控制</span> 和 <span class="underline">端到端认证</span> 
</p>

<pre class="example">
Istio 提供了对整个服务网格的行为洞察和操作控制的能力，以及一个完整的满足微服务应用各种需求的解决方案
</pre>
</div>
</div>
<div id="outline-container-org9f7399d" class="outline-3">
<h3 id="org9f7399d">为什么使用 Istio？</h3>
<div class="outline-text-3" id="text-org9f7399d">
<p>
通过负载均衡、服务间的身份验证、监控等方法，Istio 可以轻松地创建一个已经部署了服务的网络，而服务的代码只需很少更改甚至无需更改。通过在整个环境中部署一个特殊的 <span class="underline">sidecar 代理</span> 为服务添加 Istio 的支持，而代理会 <b>拦截</b> <span class="underline">微服务之间</span> 的所有 <span class="underline">网络通信</span> ，然后使用其 <span class="underline">控制平面</span> 的功能来 <b>配置</b> 和 <b>管理</b> Istio，这包括：
</p>
<ul class="org-ul">
<li>为 HTTP、gRPC、WebSocket 和 TCP 流量自动 <span class="underline">负载均衡</span></li>
<li>通过丰富的 <span class="underline">路由规则</span> 、 <span class="underline">重试</span> 、 <span class="underline">故障转移</span> 和 <span class="underline">故障注入</span> 对 <b>流量行为</b> 进行 <span class="underline">细粒度控制</span></li>
<li>可插拔的策略层和配置 API，支持 <span class="underline">访问控制</span> 、 <span class="underline">速率限制</span> 和 <span class="underline">配额</span></li>
<li>集群内（包括集群的入口和出口）所有流量的 <span class="underline">自动化度量</span> 、 <span class="underline">日志记录</span> 和 <span class="underline">追踪</span></li>
<li>在具有强大的基于 <span class="underline">身份验证</span> 和 <span class="underline">授权</span> 的集群中实现 <b>安全的</b> 服务间通信</li>
</ul>

<pre class="example">
Istio 为可扩展性而设计，可以满足不同的部署需求
</pre>
</div>
</div>
<div id="outline-container-orgc510aea" class="outline-3">
<h3 id="orgc510aea">核心特性</h3>
<div class="outline-text-3" id="text-orgc510aea">
<p>
Istio 以统一的方式提供了许多跨服务网络的关键功能
</p>
</div>
<div id="outline-container-org868f397" class="outline-4">
<h4 id="org868f397">流量管理</h4>
<div class="outline-text-4" id="text-org868f397">
<p>
Istio 简单的 <span class="underline">规则配置</span> 和 <span class="underline">流量路由</span> 允许您控制服务之间的流量和 API 调用过程。Istio 简化了 <b>服务级属性</b> （如 <span class="underline">熔断器</span> 、 <span class="underline">超时</span> 和 <span class="underline">重试</span> ）的配置，并且让它轻而易举的执行重要的任务（如 <span class="underline">A/B 测试</span> 、 <span class="underline">金丝雀发布</span> 和 <span class="underline">按流量百分比</span> 划分的分阶段发布） 
</p>

<pre class="example">
      有了更好的对流量的可视性和开箱即用的故障恢复特性，您就可以在问题产生之前捕获它们，无论面对什么情况都可以使调用更可靠，网络更健壮
</pre>
</div>
</div>
<div id="outline-container-orgc87e647" class="outline-4">
<h4 id="orgc87e647">安全</h4>
<div class="outline-text-4" id="text-orgc87e647">
<p>
Istio 的安全特性解放了开发人员，使其只需要专注于应用程序级别的安全。Istio 提供了 <b>底层的安全通信通道</b> ，并为大规模的服务通信管理 <span class="underline">认证</span> 、 <span class="underline">授权</span> 和 <span class="underline">加密</span> 
</p>
<pre class="example">
有了 Istio，服务通信在默认情况下就是受保护的，可以让您在跨不同协议和运行时的情况下实施一致的策略――而所有这些都只需要很少甚至不需要修改应用程序

Istio 是独立于平台的，可以与 Kubernetes（或基础设施）的网络策略一起使用。但它更强大，能够在网络和应用层面保护pod到 pod 或者服务到服务之间的通信
</pre>
</div>
</div>
<div id="outline-container-org404ad8e" class="outline-4">
<h4 id="org404ad8e">可观察性</h4>
<div class="outline-text-4" id="text-org404ad8e">
<p>
Istio 健壮的 <span class="underline">追踪</span> 、 <span class="underline">监控</span> 和 <span class="underline">日志</span> 特性让您能够深入的了解服务网格部署
</p>
<pre class="example">
      通过 Istio 的监控能力，可以真正的了解到服务的性能是如何影响上游和下游的

      而它的定制 Dashboard 提供了对所有服务性能的可视化能力，并让您看到它如何影响其他进程
</pre>
<p>
Istio 的 <span class="underline">Mixer 组件</span> 负责 <b>策略控制</b> 和 <b>遥测数据收集</b> 。它提供了后端抽象和中介，将一部分 Istio 与后端的基础设施实现细节隔离开来，并为运维人员提供了对网格与后端基础实施之间交互的细粒度控制
</p>

<pre class="example">
    所有这些特性都使您能够更有效地设置、监控和加强服务的 SLO。当然，底线是您可以快速有效地检测到并修复出现的问题
</pre>
</div>
</div>
<div id="outline-container-org3125273" class="outline-4">
<h4 id="org3125273">平台支持</h4>
<div class="outline-text-4" id="text-org3125273">
<p>
Istio 独立于平台，被设计为可以在各种环境中运行，包括跨云、内部环境、Kubernetes、Mesos 等等。可以在 Kubernetes 或是装有 Consul 的 Nomad 环境上部署 Istio。Istio 目前支持：
</p>
<ul class="org-ul">
<li>Kubernetes 上的服务部署</li>
<li>基于 Consul 的服务注册</li>
<li>服务运行在独立的虚拟机上</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org29427c8" class="outline-2">
<h2 id="org29427c8">流量管理</h2>
<div class="outline-text-2" id="text-org29427c8">
<pre class="example">
Istio 的 流量路由规则可以让您很容易的控制服务之间的流量和 API 调用

Istio 简化了服务级别属性的配置，比如熔断器、超时和重试，并且能轻松的设置重要的任务，如 A/B 测试、金丝雀发布、基于流量百分比切分的概率发布等

它还提供了开箱即用的故障恢复特性，有助于增强应用的健壮性，从而更好地应对被依赖的服务或网络发生故障的情况
</pre>
<p>
Istio 的流量管理模型源于和 <span class="underline">服务一起部署</span> 的 <span class="underline">Envoy 代理</span> 。 <span class="underline">网格内服务</span> <b>发送</b> 和 <b>接收</b> 的  <span class="underline">所有流量</span> （data plane流量）都经由 <span class="underline">Envoy</span> <b>代理</b> 
</p>

<pre class="example">
    这让控制网格内的流量变得异常简单，而且不需要对服务做任何的更改
</pre>
</div>
<div id="outline-container-org6ccb038" class="outline-3">
<h3 id="org6ccb038">介绍</h3>
<div class="outline-text-3" id="text-org6ccb038">
<p>
为了在网格中导流，Istio 需要知道所有的 endpoint 在哪和属于哪个服务。为了定位到 <span class="underline">service registry</span> (服务注册中心)，Istio 会连接到一个服务发现系统
</p>
<pre class="example">
     例如，如果您在 Kubernetes 集群上安装了 Istio，那么它将自动检测该集群中的服务和 endpoint
</pre>

<p>
使用此服务注册中心，Envoy 代理可以将流量定向到相关服务。大多数基于微服务的应用程序，每个服务的工作负载都有多个实例来处理流量，称为 <span class="underline">负载均衡池</span> 。默认情况下，Envoy 代理基于 <span class="underline">轮询调度</span> 模型在服务的负载均衡池内分发流量，按顺序将请求发送给池中每个成员，一旦所有服务实例均接收过一次请求后，重新回到第一个池成员 
</p>

<pre class="example">
Istio 基本的服务发现和负载均衡能力为您提供了一个可用的服务网格，但它能做到的远比这多的多

在许多情况下，您可能希望对网格的流量情况进行更细粒度的控制

作为 A/B 测试的一部分，您可能想将特定百分比的流量定向到新版本的服务，或者为特定的服务实例子集应用不同的负载均衡策略

您可能还想对进出网格的流量应用特殊的规则，或者将网格的外部依赖项添加到服务注册中心
</pre>

<p>
通过使用 Istio 的 <span class="underline">流量管理 API</span> 将流量配置添加到 Istio，就可以完成所有这些甚至更多的工作 
</p>

<pre class="example">
     和其他 Istio 配置一样，这些 API 也使用 Kubernetes 的自定义资源定义（CRDs）来声明，可以像示例中看到的那样使用 YAML 进行配置
</pre>
</div>
</div>
<div id="outline-container-org201b2c4" class="outline-3">
<h3 id="org201b2c4">虚拟服务</h3>
<div class="outline-text-3" id="text-org201b2c4">
<p>
<span class="underline">虚拟服务</span> （Virtual Service） 和 <span class="underline">目标规则</span> （Destination Rule） 是 Istio 流量路由功能的关键拼图。虚拟服务让您配置如何在服务网格内将请求路由到服务，这基于 Istio 和平台提供的基本的连通性和服务发现能力。每个虚拟服务包含一组 <span class="underline">路由规则</span> ，Istio 按顺序评估它们，Istio 将每个给定的请求匹配到虚拟服务指定的实际目标地址
</p>

<pre class="example">
     您的网格可以有多个虚拟服务，也可以没有，取决于您的使用场景
</pre>
</div>
