html/istio/concept.html

<div id="outline-container-org667d199" class="outline-4">
<h4 id="org667d199">为什么使用虚拟服务？</h4>
<div class="outline-text-4" id="text-org667d199">
<p>
虚拟服务在增强 Istio 流量管理的 <span class="underline">灵活性</span> 和 <span class="underline">有效性</span> 方面，发挥着至关重要的作用，通过对 <span class="underline">客户端请求的目标地址</span> 与 <span class="underline">真实响应请求的目标工作负载</span> 进行 <b>解耦</b> 来实现。虚拟服务同时提供了丰富的方式，为发送至这些工作负载的流量指定不同的路由规则。
</p>

<pre class="example">
      为什么这如此有用？就像在介绍中所说，如果没有虚拟服务，Envoy 会在所有的服务实例中使用轮询的负载均衡策略分发请求，您可以用您对工作负载的了解来改善这种行为

      例如，有些可能代表不同的版本。这在 A/B 测试中可能有用，您可能希望在其中配置基于不同服务版本的流量百分比路由，或指引从内部用户到特定实例集的流量
</pre>
<p>
使用 <span class="underline">虚拟服务</span> ，可以为 <span class="underline">一个或多个主机名</span> 指定 <span class="underline">流量行为</span> 。在虚拟服务中使用 <span class="underline">路由规则</span> ，告诉 Envoy 如何 <b>发送</b> <span class="underline">虚拟服务的流量</span> 到适当的 <span class="underline">目标</span> 。 <span class="underline">路由目标地址</span> 可以是 <span class="underline">同一服务的不同版本</span> ，也可以是 <span class="underline">完全不同的服务</span> 
</p>

<pre class="example">
      一个典型的用例是将流量发送到被指定为服务子集的服务的不同版本

      客户端将虚拟服务视为一个单一实体，将请求发送至虚拟服务主机，然后 Envoy 根据虚拟服务规则把流量路由到不同的版本。例如，“20% 的调用转到新版本”或“将这些用户的调用转到版本 2”

      这允许您创建一个金丝雀发布，逐步增加发送到新版本服务的流量百分比

      流量路由完全独立于实例部署，这意味着实现新版本服务的实例可以根据流量的负载来伸缩，完全不影响流量路由

      相比之下，像 Kubernetes 这样的容器编排平台只支持基于实例缩放的流量分发，这会让情况变得复杂
</pre>

<p>
虚拟服务可以让您：
</p>
<ul class="org-ul">
<li>通过单个虚拟服务处理多个应用程序服务。如果您的网格使用 Kubernetes，可以配置一个虚拟服务处理特定命名空间中的所有服务</li>
</ul>
<pre class="example">
      映射单一的虚拟服务到多个“真实”服务特别有用，可以在不需要客户适应转换的情况下，将单体应用转换为微服务构建的复合应用系统

      您的路由规则可以指定为“对这些 monolith.com 的 URI 调用转到microservice A”等等

      可以在下面的一个示例看到它是如何工作的
</pre>
<ul class="org-ul">
<li>和网关整合并配置流量规则来控制出入流量</li>
</ul>

<pre class="example">
      在某些情况下，您还需要配置目标规则来使用这些特性，因为这是指定服务子集的地方

      在一个单独的对象中指定服务子集和其它特定目标策略，有利于在虚拟服务之间更简洁地重用这些规则
</pre>
</div>
</div>

<div id="outline-container-org2526fb6" class="outline-4">
<h4 id="org2526fb6">虚拟服务示例</h4>
<div class="outline-text-4" id="text-org2526fb6">
<p>
下面的虚拟服务根据请求是否来自特定的用户，把它们路由到服务的不同版本
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #eedd82;">apiVersion</span>: networking.istio.io/v1alpha3
<span style="color: #eedd82;">kind</span>: VirtualService
<span style="color: #eedd82;">metadata</span>:
  <span style="color: #eedd82;">name</span>: reviews
<span style="color: #eedd82;">spec</span>:
  <span style="color: #eedd82;">hosts</span>:
  - reviews
  <span style="color: #eedd82;">http</span>:
  - <span style="color: #eedd82;">match</span>:
    - <span style="color: #eedd82;">headers</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">end-user</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">  exact</span>: jason
    <span style="color: #eedd82;">route</span>:
    - <span style="color: #eedd82;">destination</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">host</span>: reviews
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">subset</span>: v2
  - <span style="color: #eedd82;">route</span>:
    - <span style="color: #eedd82;">destination</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">host</span>: reviews
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">subset</span>: v3
</pre>
</div>
</div>

<div id="outline-container-orga07f878" class="outline-5">
<h5 id="orga07f878">hosts 字段</h5>
<div class="outline-text-5" id="text-orga07f878">
<p>
使用 hosts 字段列举 <span class="underline">虚拟服务的主机</span> ：即 <span class="underline">用户指定的目标</span> 或是 <span class="underline">路由规则设定的目标</span> 。这是客户端向服务发送请求时使用的一个或多个地址
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #eedd82;">hosts</span>:
- reviews
</pre>
</div>

<p>
虚拟服务主机名可以是 <span class="underline">IP 地址</span> 、 <span class="underline">DNS 名称</span> ，或者依赖于平台的一个简称（例如 <span class="underline">Kubernetes 服务的短名称</span> ），隐式或显式地指向一个 <span class="underline">完全限定域名</span> （FQDN）。您也可以使用 <span class="underline">通配符</span> （“*”）前缀，让您创建一组匹配所有服务的路由规则
</p>

<pre class="example">
       虚拟服务的 hosts 字段实际上不必是 Istio 服务注册的一部分，它只是虚拟的目标地址，这让您可以为没有路由到网格内部的虚拟主机建模
</pre>
</div>
</div>

<div id="outline-container-org4ff0408" class="outline-5">
<h5 id="org4ff0408">路由规则</h5>
<div class="outline-text-5" id="text-org4ff0408">
<p>
在 http 字段包含了虚拟服务的 <span class="underline">路由规则</span> ，用来描述 <span class="underline">匹配条件</span> 和 <span class="underline">路由行为</span> ，它们把 HTTP/1.1、HTTP2 和 gRPC 等流量发送到 <span class="underline">hosts 字段指定的目标</span> （您也可以用 tcp 和 tls 片段为 TCP 和未终止的 TLS 流量设置路由规则）。一个路由规则包含了指定的请求要流向哪个 <span class="underline">目标地址</span> ，具有 <span class="underline">0 或多个匹配条件</span> ，取决于您的使用场景 
</p>
</div>

<ul class="org-ul">
<li><a id="orga53ea31"></a>匹配条件<br />
<div class="outline-text-6" id="text-orga53ea31">
<p>
示例中的第一个路由规则有一个条件，因此以 match 字段开始
</p>

<div class="org-src-container">
<pre class="src src-yaml">- <span style="color: #eedd82;">match</span>:
   - <span style="color: #eedd82;">headers</span>:
       <span style="color: #eedd82;">end-user</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;"> exact</span>: jason
</pre>
</div>

<p>
在本例中，您希望此路由应用于来自 ”jason“ 用户的所有请求，所以使用 headers、end-user 和 exact 字段选择适当的请求
</p>
</div>
</li>

<li><a id="org1d482d2"></a>Destination<br />
<div class="outline-text-6" id="text-org1d482d2">
<p>
route 部分的 destination 字段指定了符合此条件的流量的 <span class="underline">实际目标地址</span> 。与虚拟服务的 hosts 不同，destination 的 host 必须是 <b>存在于 Istio 服务注册中心</b> 的实际目标地址，否则 Envoy 不知道该将请求发送到哪里。可以是一个 <span class="underline">有代理的服务网格</span> ，或者是一个通过 <span class="underline">服务入口</span> 被添加进来的 <span class="underline">非网格服务</span> 
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #eedd82;">route</span>:
- <span style="color: #eedd82;">destination</span>:
    <span style="color: #eedd82;">host</span>: reviews
    <span style="color: #eedd82;">subset</span>: v2
</pre>
</div>

<pre class="example">
	本示例运行在 Kubernetes 环境中，host 名为一个 Kubernetes 服务名

	请注意，在该示例和本页其它示例中，为了简单，我们使用 Kubernetes 的短名称设置 destination 的 host

	在评估此规则时，Istio 会添加一个基于虚拟服务命名空间的域后缀，这个虚拟服务包含要获取主机的完全限定名的路由规则

	在我们的示例中使用短名称也意味着您可以复制并在任何喜欢的命名空间中尝试它们
</pre>

<p>
destination 片段还指定了 <span class="underline">Kubernetes 服务的子集</span> ，将符合此规则条件的请求转入其中
</p>

<pre class="example">
	在本例中子集名称是 v2，可以在目标规则章节中看到如何定义服务子集
</pre>
</div>
</li>
</ul>
</div>

<div id="outline-container-org894d9da" class="outline-5">
<h5 id="org894d9da">路由规则优先级</h5>
<div class="outline-text-5" id="text-org894d9da">
<p>
路由规则按从上到下的顺序选择，虚拟服务中定义的第一条规则有最高优先级
</p>

<pre class="example">
       本示例中，不满足第一个路由规则的流量均流向一个默认的目标

       该目标在第二条规则中指定。因此，第二条规则没有 match 条件，直接将流量导向 v3 子集
</pre>

<p>
我们建议提供一个默认的“无条件”或基于权重的规则（见下文）作为每一个虚拟服务的最后一条规则，如案例所示，从而确保流经虚拟服务的流量至少能够匹配一条路由规则
</p>
</div>
</div>
</div>

<div id="outline-container-orgbb61912" class="outline-4">
<h4 id="orgbb61912">路由规则的更多内容</h4>
<div class="outline-text-4" id="text-orgbb61912">
<p>
正如上面所看到的，路由规则是将特定流量子集路由到指定目标地址的强大工具。您可以在流量端口、header 字段、URI 等内容上设置匹配条件
</p>

<pre class="example">
      例如，这个虚拟服务让用户发送请求到两个独立的服务：ratings 和 reviews，就好像它们是 http://bookinfo.com/ 这个更大的虚拟服务的一部分

      虚拟服务规则根据请求的 URI 和指向适当服务的请求匹配流量
</pre>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #eedd82;">apiVersion</span>: networking.istio.io/v1alpha3
<span style="color: #eedd82;">kind</span>: VirtualService
<span style="color: #eedd82;">metadata</span>:
  <span style="color: #eedd82;">name</span>: bookinfo
<span style="color: #eedd82;">spec</span>:
  <span style="color: #eedd82;">hosts</span>:
    - bookinfo.com
  <span style="color: #eedd82;">http</span>:
  - <span style="color: #eedd82;">match</span>:
    - <span style="color: #eedd82;">uri</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">prefix</span>: /reviews
    <span style="color: #eedd82;">route</span>:
    - <span style="color: #eedd82;">destination</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">host</span>: reviews
  - <span style="color: #eedd82;">match</span>:
    - <span style="color: #eedd82;">uri</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">prefix</span>: /ratings
    <span style="color: #eedd82;">route</span>:
    - <span style="color: #eedd82;">destination</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">host</span>: ratings
<span style="color: #ff4500;">...</span>

  <span style="color: #eedd82;">http</span>:
  - <span style="color: #eedd82;">match</span>:
      <span style="color: #eedd82;">sourceLabels</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">app</span>: reviews
    <span style="color: #eedd82;">route</span>:
<span style="color: #ff4500;">...</span>
</pre>
</div>

<p>
有些匹配条件可以使用精确的值，如前缀或正则。可以使用 AND 向同一个 match 块添加多个匹配条件，或者使用 OR 向同一个规则添加多个 match 块。对于任何给定的虚拟服务也可以有多个路由规则
</p>

<pre class="example">
      这可以在单个虚拟服务中使路由条件变得随您所愿的复杂或简单

      匹配条件字段和备选值的完整列表可以在 HTTPMatchRequest 参考中找到
</pre>

<p>
另外，使用匹配条件您可以按百分比 <span class="underline">权重</span> 分发请求。这在 A/B 测试和金丝雀发布中非常有用：
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #eedd82;">spec</span>:
  <span style="color: #eedd82;">hosts</span>:
  - reviews
  <span style="color: #eedd82;">http</span>:
  - <span style="color: #eedd82;">route</span>:
    - <span style="color: #eedd82;">destination</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">host</span>: reviews
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">subset</span>: v1
      <span style="color: #eedd82;">weight</span>: 75
    - <span style="color: #eedd82;">destination</span>:
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">host</span>: reviews
<span style="color: #ff0000; background-color: #ff0000; font-weight: bold;">        </span><span style="color: #eedd82;">subset</span>: v2
      <span style="color: #eedd82;">weight</span>: 25
</pre>
</div>

<p>
也可以使用路由规则在流量上执行一些操作，例如：
</p>
<ul class="org-ul">
<li>添加或删除 header</li>
<li>重写 URL</li>
<li>为调用这一目标地址的请求设置重试策略。</li>
</ul>

<pre class="example">
      想了解如何利用这些操作，查看 HTTPRoute 参考
</pre>
</div>
</div>
</div>
